[{"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/347753856e44bdeb7cf5830694669a5d?s=40&d=identicon", "id": 88, "name": "Tiago Giusti", "username": "giustin"}, "id": 7384, "body": "Olá, Prof. Paulo @paulormm e demais @obsneto @nayanne @marisa @fbraga @lucasdavila \r\n\r\nA nível de esclarecimento, a mensagem do escopo desta issue é originária de um e-mail meu, enviado a @marisa da Coordenação do Portal. Como a mesma estava de férias, o @obsneto prontamente encaminhou para a equipe do Prof. @paulormm.\r\n\r\nOcorre que nós Coordenadores de Comunidade temos uma orientação geral de se comunicar com a Coordenação geral sobre alguns trâmites do Portal, principalmente agora neste período de transição. Como a Coordenação orienta para mantermos um padrão de operação em todas as Comunidades, eu preferi perguntar antes de alterar qualquer coisa.  \r\n\r\nTenho acesso a interface de administração do Mailman e conheço como devem ser feitas as configurações. Ainda em dez/2015 efetuei as alterações para não existir mais limites nas mensagens e mantive a regra de não permitir envio de mensagem para a lista para quem não for membro. Se houver necessidades, promoverei novas mudanças.\r\n\r\nObrigado a todos e qualquer coisa, estou à disposição.", "created_at": "2016-01-06T20:04:12.361Z", "attachment": null}, {"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/b4c7afc2cdffea95a8c2d0387acedc6b?s=40&d=identicon", "id": 15, "name": "Paulo Meireles", "username": "paulormm"}, "id": 7157, "body": "@lucasdavila espero que a lista já tenha sido configurada corretamente; caso não, deixe-me saber que eu mesmo farei. Sobre você ser admin ou não da comunidade, creio que não depende de você ser ou não da Portabilis, mas, como não sou do MPOG, não sei os detalhes da \"meritocracia\" para tal. No mais, parabéns pela a iEducativa: desejo sucesso!", "created_at": "2016-01-04T13:53:50.424Z", "attachment": null}, {"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/7a8919c03027d6e77450a1042ea5369a?s=40&d=identicon", "id": 526, "name": "Lucas D'Avila", "username": "lucasdavila"}, "id": 7144, "body": "Oi Paulo!\r\n\r\nEntendi, então basta alterar a configuração de limite máximo dos emails para resolver este problema, acredito que o Tiago fará isto, uma vez que você enviou email a ele.\r\n\r\nApenas um adendo, eu não sou mais desenvolvedor da Portabilis desde abril de 2013 rs. Atualmente eu atuo na comunidade pela iEducativa, empresa que fundei no fim de 2014.\r\n\r\nAbraço.", "created_at": "2015-12-31T04:33:49.607Z", "attachment": null}, {"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/b4c7afc2cdffea95a8c2d0387acedc6b?s=40&d=identicon", "id": 15, "name": "Paulo Meireles", "username": "paulormm"}, "id": 7116, "body": "_Status changed to closed_", "created_at": "2015-12-30T01:55:14.360Z", "attachment": null}, {"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/b4c7afc2cdffea95a8c2d0387acedc6b?s=40&d=identicon", "id": 15, "name": "Paulo Meireles", "username": "paulormm"}, "id": 7115, "body": "Isto não é um problema. É apenas uma questão de configuração e administração da lista, via a interface do Mailman. As instruções foram passadas ao email \"tgiusti at gmail.com\", em resposta ao email que fui copiado.\r\n\r\nOrlando ( @obsneto ), a @nayanne e a @marisa tem o conhecimento necessário para fazer tais orientações aos usuários e este tipo de coisa não é issue/problema de desenvolvimento para a UnB.\r\n\r\n@lucasdavila , caso queira, uma vez que você é desenvolvedor ativo da Portabilis/I-Educar, solicite para também ser admin da lista, uma vez que parece que o Tiago não entendeu que os admins da lista é quem administram e configuram a lista, via interface do Mailman.\r\n", "created_at": "2015-12-30T01:55:13.804Z", "attachment": null}, {"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/7a8919c03027d6e77450a1042ea5369a?s=40&d=identicon", "id": 526, "name": "Lucas D'Avila", "username": "lucasdavila"}, "id": 7113, "body": "Oi @paulormm \r\n\r\nIsto aconteceu comigo na lista do iEducar também, recebi o email abaixo após ter respondido uma thread da lista:\r\n\r\n\"Your mail to 'i-Educar' with the subject\r\nRe: [i-Educar] Versão do php do ieducar\r\nIs being held until the list moderator can review it for approval.\r\nThe reason it is being held:\r\nMessage body is too big: 47204 bytes with a limit of 40 KB\"\r\n\r\nIsto acontece pois algumas discussões recebem muitas respostas, ou seja acontece uma grande participação de membros. Isto porque ao responder um email, as respostas dos emails anteriores são enviadas no corpo do novo email, abaixo.\r\n\r\nOu seja, a cada email enviado o corpo da mensagem aumenta em muito, pois contem a nova resposta e todas as outras.\r\n\r\n\r\nUma solução seria colocar um limite de corpo de email similar ao que o gmail permite por exemplo, onde não aconteceriam estes erros.\r\n\r\nOu então seria escrever um parser na lista de email, para remover automaticamente do corpo da mensagem o histórico dos últimos emails.", "created_at": "2015-12-29T15:54:44.460Z", "attachment": null}, {"author": {"state": "active", "avatar_url": "http://cdn.libravatar.org/avatar/a8b31798b40d0d3030251879092b0605?s=40&d=identicon", "id": 1066, "name": "Felipe Braga", "username": "fbraga"}, "id": 7111, "body": "acho 40KB é um limite muito baixo: e-mail com texto de algumas já passa fácil disso (aconteceu comigo ontem na https://listas.softwarepublico.gov.br/mailman/cgi-bin/listinfo/i-educar)\r\n\r\nSugiro apenas aumentar esse limite (pra uns 200K), pra ajudar a evitar SPAM :P", "created_at": "2015-12-29T14:23:48.191Z", "attachment": null}]